/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2014-12-02  */
/*     #######          ###    ###      [GFX3]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>>>>>>>>>>> CrHack 高度图函数库 <<<<<<<<<<<<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#ifndef __CR_HEIGHTMAP_C__
#define __CR_HEIGHTMAP_C__ 0x0D6C265FUL

#include "memlib.h"
#include "gfx3int.h"

#ifndef _CR_NO_STDC_
    #include <math.h>
#endif

/*
=======================================
    生成高度图
=======================================
*/
CR_API ht_map_t
height_map_new (
  __CR_IN__ const void_t*   data,
  __CR_IN__ uint_t          type,
  __CR_IN__ uint_t          width,
  __CR_IN__ uint_t          height,
  __CR_IN__ fp32_t          scale
    )
{
}

/*
=======================================
    释放高度图
=======================================
*/
CR_API void_t
height_map_del (
  __CR_IN__ ht_map_t    htmap
    )
{
}

/*
=======================================
    获取高度值
=======================================
*/
CR_API fp32_t
height_map_get (
  __CR_IN__ ht_map_t    htmap,
  __CR_IN__ fp32_t      x,
  __CR_IN__ fp32_t      z
    )
{
}

/*
=======================================
    获取顶点法线
=======================================
*/
CR_API void_t
height_map_nrm (
  __CR_IN__ ht_map_t    htmap,
  __CR_OT__ vec3d_t*    normal,
  __CR_IN__ fp32_t      x,
  __CR_IN__ fp32_t      z
    )
{
}

/*
=======================================
    获取块包围盒
=======================================
*/
CR_API void_t
height_map_aabb (
  __CR_IN__ ht_map_t    htmap,
  __CR_OT__ sAABB*      aabb,
  __CR_IN__ uint_t      x,
  __CR_IN__ uint_t      z,
  __CR_IN__ uint_t      w,
  __CR_IN__ uint_t      h
    )
{
}

#endif  /* !__CR_HEIGHTMAP_C__ */

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
