/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2010-08-12  */
/*     #######          ###    ###      [KRNL]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>>> CrHack MAXIM MAX124X 器件定义头文件 <<<<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#ifndef __CR_MAX124X_H__
#define __CR_MAX124X_H__

#include "../defs.h"

/* 模拟通道编号 */
#define MAX124X_CH0_COM     1   /* 单端 */
#define MAX124X_CH1_COM     5   /* 单端 */
#define MAX124X_CH2_COM     2   /* 单端 */
#define MAX124X_CH3_COM     6   /* 单端 */
/* ------------------------------------ */
#define MAX124X_CH0_CH1     1   /* 差分 */
#define MAX124X_CH2_CH3     2   /* 差分 */
#define MAX124X_CH1_CH0     5   /* 差分 */
#define MAX124X_CH3_CH2     6   /* 差分 */
/* ------------------------------------ */

/* 时钟掉电模式 */
#define MAX124X_FULL_PWRD   0   /* Full power-down */
#define MAX124X_FAST_PWRD   1   /* Fast power-down */
#define MAX124X_INT_CLOCK   2   /* Internal clock mode */
#define MAX124X_EXT_CLOCK   3   /* External clock mode */
/* --------------------------------------------------- */

/*
 *=============================================================================
 *      pd1-pd0     (0 - 3)     时钟掉电模式
 *      sgl/dif     (0)         单端模拟输入
 *                  (1)         差分模拟输入
 *      uni/bip     (0)         正电压模式
 *                  (1)         正负压模式
 *      sel2-sel0   (0 - 7)     模拟通道选择
 *      start       (1)         起始位必为1
 *=============================================================================
 */
#define MAX124X_CNTRL(pd, sgl, uni, sel) \
            ((pd) | ((sgl) << 2) | ((uni) << 3) | ((sel) << 4) | 0x80)

#endif  /* !__CR_MAX124X_H__ */

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
