/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2010-05-13  */
/*     #######          ###    ###      [PORT]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>>>>> CrHack KeilC51 编译器配置头文件 <<<<<<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#ifndef __CR_CX51_H__
#define __CR_CX51_H__

/*****************************/
/* 版本值 701 表示版本 V7.01 */
/*****************************/
#if defined(__C51__) || defined(__CX51__)

    /* 编译器类型定义 */
    #define _CR_CC_CX51_
    /*------------------------------------------------*/

    /* 编译器版本定义 */
    #ifndef __CX51__
        #define _CR_CC_VER_     __C51__
    #else
        #define _CR_CC_VER_     __CX51__
    #endif
    /*------------------------------------------------*/

    /* 编译器名称定义 */
    #define _CR_CC_STR_     "KeilC51"
    /*------------------------------------------------*/

    /* 编译器版本过滤 */
    #if (_CR_CC_VER_ < 701)
        #error "cx51.h: CC TYPE not supported yet!"
    #endif
    /*------------------------------------------------*/

    /* 编译器平台架构 */
    #define _CR_AR_MCS51_   /* Intel MCS-51 */
    /*------------------------------------------------*/

    /* 编译器操作系统 */
    #define _CR_OS_NAKED_
    /*------------------------------------------------*/

    /* 编译器全局定义 */
    #include <intrins.h>
    #ifndef _CR_USE_51_DATA_
        #define data    _nouse_data_
    #endif
    #define _CR_ORDER_BE_       /* 大端模式 */
    #define _CR_SICK_INLINE_    /* 剔除内联 */
    /*------------------------------------------------*/

    /* 编译器内存模型 */
    #define _CR_SMALL_  /* 16bit 小模式 */
    #undef  _CR_LARGE_  /* 16bit 巨模式 */
    /*------------------------------------------------*/

    /* 编译器特有类型 */
    typedef bit     ubit_t;
    /*------------------------------------------------*/

    /* 编译器指针修饰 */
    #define _far_   far
    #define _rom_   code
    #define _slw_   idata
    #define _pge_   pdata
    #define _ram_   xdata
    /*------------------------------------------------*/

    /* 编译器浮点配置 */
    #undef  _CR_NO_FLT32_
    #define _CR_NO_FLT64_
    #define _CR_DOUBLE32_
    /*------------------------------------------------*/

    /* 编译器64位整数 */
    #define _CR_NO_INT64_
    #undef  _CR_USE_LLONG_
    #undef  _CR_USE_INT64_
    /*------------------------------------------------*/

    /* 编译器64位常数后缀 */
    #define CR_SLL(x)   x
    #define CR_ULL(x)   x
    /*------------------------------------------------*/

    /* 编译器内联函数修饰 */
    #define _CR_NO_INLINE_
    #define cr_inline       static
    /*------------------------------------------------*/

    /* 编译器汇编内联函数 */
    #define fasm_inline     static
    /*------------------------------------------------*/

    /* 编译器安全内联函数 */
    #define safe_inline     static
    /*------------------------------------------------*/

    /* 编译器函数导出修饰 */
    #define CR_EXPORT
    #define CR_IMPORT
    /*------------------------------------------------*/

    /* 编译器内联汇编风格 */
    #undef  _CR_ASM_INTL_
    #undef  _CR_ASM_ATnT_
    /*------------------------------------------------*/

    /* 编译器成员对齐修饰 */
    #define CR_ALIGN(x)
    /*------------------------------------------------*/

    /* 编译器导入库的选项 */
    #define _CR_NO_PRAGMA_LIB_
    /*------------------------------------------------*/

    /* 编译器紧凑结构修饰 */
    #define CR_PACKED
    #define CR_TYPEDEF  typedef
    #define _CR_NO_PRAGMA_PACK_
    /*------------------------------------------------*/

    /* 编译器分支优化指示 */
    #define surely(x)   (x)
    #define mostly(x)   (x)
    #define rarely(x)   (x)
    /*------------------------------------------------*/

    /* 编译器不支持多线程 */
    #define _CR_NO_MT_
    /*------------------------------------------------*/

    /* 编译器不支持宽字符 */
    #define _CR_NO_WIDE_
    /*------------------------------------------------*/

    /* 编译器指令函数优化 */
    #define cr_rotl08   _crol_
    #define cr_rotr08   _cror_
    #define cr_rotl16   _irol_
    #define cr_rotr16   _iror_
    #define cr_rotl32   _lrol_
    #define cr_rotr32   _lror_
    /*------------------------------------------------*/

    /* LIBC printf() 整数宽度前缀 */
    #define CR_I32  "L"
    #define CR_I64
    /*------------------------------------------------*/

    /* LIBC 是否有 errno.h 头文件 */
    #undef  _CR_NO_ERRNO_
    /*------------------------------------------------*/

    /* LIBC 支持64位STDIO文件偏移 */
    #define _CR_NO_STDIO64_
    #undef  _CR_MS_STDIO64_
    /*------------------------------------------------*/

    /* LIBC 支持 C99 数学函数设置 */
    #define _CR_NO_MATHC99_
    /*------------------------------------------------*/

    /* LIBC beginthreadex() 返回值 */
    #undef  CR_BTEX_FAIL
    /*------------------------------------------------*/

    /* LIBC 支持宽字符串函数的设置 */
    #undef  _CR_HAVE_WCS_
    /*------------------------------------------------*/

    /* 处理器架构的空指令宏设置 */
    #define CR_NOP  _nop_()
    /*------------------------------------------------*/

#endif  /* __C51__ || __CX51__ */

#endif  /* !__CR_CX51_H__ */

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
