/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2013-08-07  */
/*     #######          ###    ###      [FMTZ]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>>>>>>>> CrHack TGL FMTZ 插件头文件 <<<<<<<<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#ifndef __CR_TGL_H__
#define __CR_TGL_H__

#include "../fmtz.h"

/* PAC 文件信息结构 */
typedef struct
{
        /* 公用部分 */
        sPAK_FILE   base;

        /* 个性部分 */
        int32u  ftype;  /* 文件压缩类型 */

} sPAK_TGL_FILE;

/*****************************************************************************/
/*                                 引擎接口                                  */
/*****************************************************************************/

CR_API sENGINE*     engine_tgl (void_t);

/*****************************************************************************/
/*                               封包文件格式                                */
/*****************************************************************************/

CR_API sFMT_PRT*    load_tgl_pac  (iDATIN *datin, const sLOADER *param);
CR_API sFMT_PRT*    load_tgl_ipac (iDATIN *datin, const sLOADER *param);

/*****************************************************************************/
/*                               数据文件格式                                */
/*****************************************************************************/

CR_API sFMT_DAT*    load_tgl_sdc  (iDATIN *datin, const sLOADER *param);
CR_API sFMT_DAT*    load_tgl_iel1 (iDATIN *datin, const sLOADER *param);

/*****************************************************************************/
/*                               图片文件格式                                */
/*****************************************************************************/

CR_API sFMT_PRT*    load_tgl_acf (iDATIN *datin, const sLOADER *param);
CR_API sFMT_PIC*    load_tgl_bmr (iDATIN *datin, const sLOADER *param);
CR_API sFMT_PIC*    load_tgl_cgr (iDATIN *datin, const sLOADER *param);

#endif  /* !__CR_TGL_H__ */

/*****************************************************************************/
/* _________________________________________________________________________ */
/* uBMAzRBoAKAHaACQD6FoAIAPqbgA/7rIA+5CM9uKw8D4Au7u7mSIJ0t18mYz0mYz9rAQZCgHc */
/* wRIZIgHZovGBXUAZg+v0GbB+gRmgcJ7BAAAisIlAwB1Av7LSHUC/s9IdQL+w0h1Av7HZkZmgf */
/* 4JLgIAdb262gPsqAh0+zP/uQB9ZYsFZYktq+L3sMi/AAK7gAKJAUtLdfq5IANXvT8BiQzfBIv */
/* FLaAAweAEmff53wb+Adjx3kQE2xwy5Io8ithkigcFgACJBN8E3sneNvwB2xyLHDkdfA2JHSyA */
/* adtAAQPdZYgHR0dNdbZfSYP5UHWr/kQEtAHNFg+Eef/DWAKgDw== |~~~~~~~~~~~~~~~~~~~ */
/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ >>> END OF FILE <<< */
/*****************************************************************************/
