/*****************************************************************************/
/*                                                  ###                      */
/*       #####          ###    ###                  ###  CREATE: 2010-01-27  */
/*     #######          ###    ###      [GFX2]      ###  ~~~~~~~~~~~~~~~~~~  */
/*    ########          ###    ###                  ###  MODIFY: XXXX-XX-XX  */
/*    ####  ##          ###    ###                  ###  ~~~~~~~~~~~~~~~~~~  */
/*   ###       ### ###  ###    ###    ####    ####  ###   ##  +-----------+  */
/*  ####       ######## ##########  #######  ###### ###  ###  |  A NEW C  |  */
/*  ###        ######## ########## ########  ###### ### ###   | FRAMEWORK |  */
/*  ###     ## #### ### ########## ###  ### ###     ######    |  FOR ALL  |  */
/*  ####   ### ###  ### ###    ### ###  ### ###     ######    | PLATFORMS |  */
/*  ########## ###      ###    ### ######## ####### #######   |  AND ALL  |  */
/*   #######   ###      ###    ### ########  ###### ###  ###  | COMPILERS |  */
/*    #####    ###      ###    ###  #### ##   ####  ###   ##  +-----------+  */
/*  =======================================================================  */
/*  >>>>>>>>>>>>>>>>>>>>>>>> CrHack 软件 2D 头文件 <<<<<<<<<<<<<<<<<<<<<<<<  */
/*  =======================================================================  */
/*****************************************************************************/

#ifndef __CR_BLIT_H__
#define __CR_BLIT_H__

#include "gfx2.h"
#include "fileio.h"

/*****************************************************************************/
/*                                 公用部分                                  */
/*****************************************************************************/

/* 字节像素结构 */
typedef struct
{
/*000*/ byte_t  idx;    /* 颜色值 */
/*001*/ byte_t  rv1;    /* 保留值 */
/*002*/ byte_t  rv2;    /* 保留值 */
/*003*/ byte_t  lrp;    /* 透明值 */
/*004*/
} pix1_t;

/* 16位像素结构 */
typedef struct
{
/*000*/ int16u  clr;    /* 颜色值 */
/*002*/ byte_t  rv1;    /* 保留值 */
/*003*/ byte_t  lrp;    /* 透明值 */
/*004*/
} pix2_t;

/* 32位像素结构 */
typedef struct
{
/*000*/ byte_t  bbb;    /* 蓝分量 */
/*001*/ byte_t  ggg;    /* 绿分量 */
/*002*/ byte_t  rrr;    /* 红分量 */
/*003*/ byte_t  lrp;    /* 透明值 */
/*004*/
} pix4_t;

/* 统一像素结构 */
typedef union
{
        int32u  val;    /* 32位数值 */
        pix1_t  c08;    /* 字节像素 */
        pix2_t  c16;    /* 16位像素 */
        pix4_t  c32;    /* 32位像素 */

} cpix_t;

/* 像素渲染模式值 */
#define CR_BLT_MAX  7
#define CR_BLT_SET  0   /* 直接复制 */
#define CR_BLT_AND  1   /* 逻辑  与 */
#define CR_BLT_ORR  2   /* 逻辑  或 */
#define CR_BLT_NOT  3   /* 逻辑  非 */
#define CR_BLT_XOR  4   /* 逻辑异或 */
#define CR_BLT_ADD  5   /* 饱和加法 */
#define CR_BLT_SUB  6   /* 饱和减法 */
#define CR_BLT_ALP  7   /* 透明混合 */

/* 像素转换/绘制函数类型 */
typedef cpix_t  (*pixcnvt_t) (const int32u*, cl32_t);
typedef void_t  (*pixdraw_t) (const sIMAGE*, sint_t, sint_t, cpix_t);
typedef void_t  (*dotdraw_t) (const sIMAGE*, fp32_t, fp32_t, cpix_t);

#if !defined(_CR_SICK_INLINE_)
/*
=======================================
    08位色插值参数设置
=======================================
*/
cr_inline cpix_t
CR_COLOR08 (
  __CR_IN__ byte_t  c08,
